app/mailers/order_mailer.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def order_send_admin_email(order)
     #on récupère l'instance order pour ensuite pouvoir la passer à la view en @user
     @order_id = order.id
     puts @order_id

     @user_id = order.user_id
     @user = User.find(@user_id)