app/controllers/home_controller.rb

  def index
    @items = Item.first(7)
---
SELECT  "items".* FROM "items" ORDER BY "items"."id" ASC LIMIT $1  [["LIMIT", 7]]